Adjusted use cases
